# St7SetFreeNodes

Sets the display option for free nodes.

long St7SetFreeNodes(long uID, long Style)
Input Parameters
uID
Strand7 model file ID.
Style
One of nsFreeNodeAll, nsFreeNodeNone, nsFreeNodeGroup or nsFreeNodeGroupFree.